---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InfrastructureAlignmentName
source: html/65306f87-c85a-aebf-6bcb-b1160b708745.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InfrastructureAlignmentName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId InfrastructureAlignmentName { get; }
```